Ran Plan for dir: `deployment/terraform` workspace: `dev`

<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cvat_postgresql.data.template_file.complete will be read during apply
  # (config refers to values not yet known)
 <= data "template_file" "complete"  {
+       id       = (known after apply)
+       rendered = (known after apply)
+       template = "true"
    }

  # module.cvat_postgresql.google_secret_manager_secret.default["cvat"] will be created
+ resource "google_secret_manager_secret" "default" {
+       create_time = (known after apply)
+       expire_time = (known after apply)
+       id          = (known after apply)
+       labels      = {
+           "cc"           = "unico-check"
+           "environment"  = "dev"
+           "ephemeral"    = "false"
+           "name"         = "cvat-pgsql-dev"
+           "service"      = "cvat"
+           "squad"        = "check-liveness"
+           "terraform"    = "true"
+           "tribe"        = "check"
+           "type_of_cost" = "investimento"
        }
+       name        = (known after apply)
+       project     = "acesso-core-dev"
+       secret_id   = "CLOUDSQL_CVAT-PGSQL-DEV_CVAT"

+       replication {
+           automatic = true
        }
    }

  # module.cvat_postgresql.google_secret_manager_secret.default_admin will be created
+ resource "google_secret_manager_secret" "default_admin" {
+       create_time = (known after apply)
+       expire_time = (known after apply)
+       id          = (known after apply)
+       labels      = {
+           "cc"           = "unico-check"
+           "environment"  = "dev"
+           "ephemeral"    = "false"
+           "name"         = "cvat-pgsql-dev"
+           "service"      = "cvat"
+           "squad"        = "check-liveness"
+           "terraform"    = "true"
+           "tribe"        = "check"
+           "type_of_cost" = "investimento"
        }
+       name        = (known after apply)
+       project     = "acesso-core-dev"
+       secret_id   = "CLOUDSQL_CVAT-PGSQL-DEV_MASTER_ADMIN"

+       replication {
+           automatic = true
        }
    }

  # module.cvat_postgresql.google_secret_manager_secret_version.database_admin_secrets will be created
+ resource "google_secret_manager_secret_version" "database_admin_secrets" {
+       create_time  = (known after apply)
+       destroy_time = (known after apply)
+       enabled      = true
+       id           = (known after apply)
+       name         = (known after apply)
+       secret       = (known after apply)
+       secret_data  = (sensitive value)
    }

  # module.cvat_postgresql.google_secret_manager_secret_version.database_user_secrets["cvat"] will be created
+ resource "google_secret_manager_secret_version" "database_user_secrets" {
+       create_time  = (known after apply)
+       destroy_time = (known after apply)
+       enabled      = true
+       id           = (known after apply)
+       name         = (known after apply)
+       secret       = (known after apply)
+       secret_data  = (sensitive value)
    }

  # module.cvat_postgresql.google_sql_database.default["cvat"] will be created
+ resource "google_sql_database" "default" {
+       charset   = "UTF8"
+       collation = "en_US.UTF8"
+       id        = (known after apply)
+       instance  = "cvat-pgsql-dev"
+       name      = "cvat"
+       project   = "acesso-core-dev"
+       self_link = (known after apply)
    }

  # module.cvat_postgresql.google_sql_database_instance.master will be created
+ resource "google_sql_database_instance" "master" {
+       connection_name               = (known after apply)
+       database_version              = "POSTGRES_13"
+       deletion_protection           = true
+       first_ip_address              = (known after apply)
+       id                            = (known after apply)
+       ip_address                    = (known after apply)
+       master_instance_name          = (known after apply)
+       name                          = "cvat-pgsql-dev"
+       private_ip_address            = (known after apply)
+       project                       = "acesso-core-dev"
+       public_ip_address             = (known after apply)
+       region                        = "us-east1"
+       self_link                     = (known after apply)
+       server_ca_cert                = (known after apply)
+       service_account_email_address = (known after apply)

+       replica_configuration {
+           ca_certificate            = (known after apply)
+           client_certificate        = (known after apply)
+           client_key                = (known after apply)
+           connect_retry_interval    = (known after apply)
+           dump_file_path            = (known after apply)
+           failover_target           = (known after apply)
+           master_heartbeat_period   = (known after apply)
+           password                  = (sensitive value)
+           ssl_cipher                = (known after apply)
+           username                  = (known after apply)
+           verify_server_certificate = (known after apply)
        }

+       settings {
+           activation_policy     = "ALWAYS"
+           availability_type     = "ZONAL"
+           disk_autoresize       = true
+           disk_autoresize_limit = 0
+           disk_size             = 10
+           disk_type             = "PD_SSD"
+           pricing_plan          = "PER_USE"
+           tier                  = "db-f1-micro"
+           user_labels           = {
+               "cc"           = "unico-check"
+               "environment"  = "dev"
+               "ephemeral"    = "false"
+               "name"         = "cvat-pgsql-dev"
+               "service"      = "cvat"
+               "squad"        = "check-liveness"
+               "terraform"    = "true"
+               "tribe"        = "check"
+               "type_of_cost" = "investimento"
            }
+           version               = (known after apply)

+           backup_configuration {
+               binary_log_enabled             = false
+               enabled                        = true
+               point_in_time_recovery_enabled = false
+               start_time                     = "04:00"
+               transaction_log_retention_days = (known after apply)

+               backup_retention_settings {
+                   retained_backups = (known after apply)
+                   retention_unit   = (known after apply)
                }
            }

+           ip_configuration {
+               ipv4_enabled = false
+               require_ssl  = false
            }

+           location_preference {
+               zone = "us-east1-b"
            }

+           maintenance_window {
+               day          = 6
+               hour         = 2
+               update_track = "stable"
            }
        }

+       timeouts {
+           create = "60m"
+           delete = "60m"
+           update = "60m"
        }
    }

  # module.cvat_postgresql.google_sql_user.database_users["cvat"] will be created
+ resource "google_sql_user" "database_users" {
+       host     = (known after apply)
+       id       = (known after apply)
+       instance = "cvat-pgsql-dev"
+       name     = "cvat"
+       password = (sensitive value)
+       project  = "acesso-core-dev"
    }

  # module.cvat_postgresql.google_sql_user.default will be created
+ resource "google_sql_user" "default" {
+       host     = (known after apply)
+       id       = (known after apply)
+       instance = "cvat-pgsql-dev"
+       name     = "masteradmin"
+       password = (sensitive value)
+       project  = "acesso-core-dev"
    }

  # module.cvat_postgresql.null_resource.dependency_getter will be created
+ resource "null_resource" "dependency_getter" {
+       id = (known after apply)
    }

  # module.cvat_postgresql.random_password.password["cvat"] will be created
+ resource "random_password" "password" {
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       result      = (sensitive value)
+       special     = true
+       upper       = true
    }

  # module.cvat_postgresql.random_password.password_admin will be created
+ resource "random_password" "password_admin" {
+       id          = (known after apply)
+       length      = 16
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       result      = (sensitive value)
+       special     = true
+       upper       = true
    }

  # module.redis.google_redis_instance.default will be created
+ resource "google_redis_instance" "default" {
+       alternative_location_id  = (known after apply)
+       auth_enabled             = true
+       auth_string              = (sensitive value)
+       authorized_network       = (known after apply)
+       connect_mode             = "PRIVATE_SERVICE_ACCESS"
+       create_time              = (known after apply)
+       current_location_id      = (known after apply)
+       display_name             = "cvat-redis-dev"
+       host                     = (known after apply)
+       id                       = (known after apply)
+       labels                   = {
+           "cc"           = "unico-check"
+           "environment"  = "dev"
+           "ephemeral"    = "false"
+           "name"         = "cvat-redis-dev"
+           "service"      = "cvat"
+           "squad"        = "check-liveness"
+           "terraform"    = "true"
+           "tribe"        = "check"
+           "type_of_cost" = "investimento"
        }
+       location_id              = "us-east1-b"
+       memory_size_gb           = 16
+       name                     = "cvat-redis-dev"
+       nodes                    = (known after apply)
+       persistence_iam_identity = (known after apply)
+       port                     = (known after apply)
+       project                  = "acesso-core-dev"
+       read_endpoint            = (known after apply)
+       read_endpoint_port       = (known after apply)
+       read_replicas_mode       = (known after apply)
+       redis_version            = "REDIS_6_X"
+       region                   = "us-east1"
+       replica_count            = (known after apply)
+       reserved_ip_range        = (known after apply)
+       server_ca_certs          = (known after apply)
+       tier                     = "BASIC"
+       transit_encryption_mode  = "DISABLED"

+       maintenance_policy {
+           create_time = (known after apply)
+           description = "Redis Maintanance schedule."
+           update_time = (known after apply)

+           weekly_maintenance_window {
+               day      = "SUNDAY"
+               duration = (known after apply)

+               start_time {
+                   hours   = 23
+                   minutes = 30
+                   nanos   = 0
+                   seconds = 0
                }
            }
        }
    }

  # module.redis.google_secret_manager_secret.default will be created
+ resource "google_secret_manager_secret" "default" {
+       create_time = (known after apply)
+       expire_time = (known after apply)
+       id          = (known after apply)
+       labels      = {
+           "cc"           = "unico-check"
+           "environment"  = "dev"
+           "ephemeral"    = "false"
+           "name"         = "cvat-redis-dev"
+           "service"      = "cvat"
+           "squad"        = "check-liveness"
+           "terraform"    = "true"
+           "tribe"        = "check"
+           "type_of_cost" = "investimento"
        }
+       name        = (known after apply)
+       project     = "acesso-core-dev"
+       secret_id   = "cvat-redis-dev-secret"

+       replication {
+           automatic = true
        }
    }

  # module.redis.google_secret_manager_secret_iam_member.default["core-compute"] will be created
+ resource "google_secret_manager_secret_iam_member" "default" {
+       etag      = (known after apply)
+       id        = (known after apply)
+       member    = "serviceAccount:core-compute@acesso-core-dev.iam.gserviceaccount.com"
+       project   = "acesso-core-dev"
+       role      = "roles/secretmanager.secretAccessor"
+       secret_id = "cvat-redis-dev-secret"
    }

  # module.redis.google_secret_manager_secret_version.default will be created
+ resource "google_secret_manager_secret_version" "default" {
+       create_time  = (known after apply)
+       destroy_time = (known after apply)
+       enabled      = true
+       id           = (known after apply)
+       name         = (known after apply)
+       secret       = (known after apply)
+       secret_data  = (sensitive value)
    }

Plan: 15 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ db_name                   = {
+       cvat = "cvat"
    }
+ master_db_name            = {
+       cvat = "cvat"
    }
+ master_instance_name      = "cvat-pgsql-dev"
+ master_private_ip_address = (known after apply)
+ redis_host                = (known after apply)
+ redis_id                  = (known after apply)
+ redis_name                = "cvat-redis-dev"


[33mUpdate:[0m A new version of Infracost is available: [96mv0.9.21[0m → [96mv0.9.22[0m
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d deployment/terraform -w dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.private.unico.run/lock?id=acesso-io%252Ftechcore-cvat%252Fdeployment%252Fterraform%252Fdev)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d deployment/terraform -w dev`
</details>
Plan: 15 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
